app/controllers/vendas_controller.rb

SELECT * FROM `vendas` WHERE (`vendas`.`data` = '2008-01-01') ORDER BY quantidade
---
  def lista
    @data = Date.new(params[:ano].to_i, params[:mes].to_i, params[:dia].to_i)
    @data_proxima = @data + 1
    @data_anterior = @data - 1
    @vendas = Venda.find_all_by_data(@data)

SELECT * FROM `vendas` WHERE (`vendas`.`id` = 2008)
---
  def show
    @venda = Venda.find(params[:id])

SELECT * FROM `vendas` WHERE (`vendas`.`id` = 5)
---
  def edit
    @venda = Venda.find(params[:id])

INSERT INTO `vendas` (`custo_unitario`, `produto_id`, `updated_at`, `quantidade`, `ordem`, `descricao`, `valor_total`, `data`, `created_at`) VALUES(0.0, NULL, '2008-12-05 01:26:35', 1.0, NULL, 'hhgg', 0.0, '2008-01-01', '2008-12-05 01:26:35')
---
  def create
    @venda = Venda.new
    @venda.parse_form(params[:venda])
    respond_to do |format|
      if @venda.save

SELECT * FROM `vendas` WHERE (`vendas`.`id` = 5)
UPDATE `vendas` SET `descricao` = 'xyz', `valor_total` = 8.81, `custo_unitario` = 2.4, `updated_at` = '2008-12-06 02:01:37', `quantidade` = 1.2 WHERE `id` = 8
---
  def update
    @venda = Venda.find(params[:id])

    respond_to do |format|
      @venda.parse_form(params[:venda])
      if @venda.save

SELECT * FROM `vendas` WHERE (`vendas`.`id` = 7)
DELETE FROM `vendas` WHERE `id` = 7
---
  def destroy
    @venda = Venda.find(params[:id])
    data = @venda.data
    @venda.destroy